humodule.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'AZIZ',
description: 'Greating',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3

};

const nam = [{

timer: '09:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 12:00 ❍"𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭Mid-Night.🤤🤤\n😍🥰🥰\n★\nㅤ']

}, 

{

timer: '10:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 01:00 ❍"𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭MIDNIGHT😛😛\n😍🥰🥰\n★\nㅤ']

},

{

timer: '11:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 2:00 ❍"𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭Morning All 😍\n😍🥰🥰\n★\nㅤ"]

},

{

timer: '12:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 3:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭HORROR TIME😛\n😍🥰🥰\n★\nㅤ']

},

{

timer: '1:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 4:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭GOOD MORNING\n😍🥰🥰\n★\nㅤ']

},

{

timer: '2:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 05:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\nASSALAM ALAIKUM😍\n❤GOOD MORNING\n😍🥰🥰\n★\nㅤ']

},

{

timer: '3:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 6:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭LETS COOK BREAKFAST 😂\n😍🥰🥰\n★\nㅤ']

},

{

timer: '4:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 7:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─HAVE A SWEET MORNING\n😍🥰🥰\n★\nㅤ']

},

{

timer: '5:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 8:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭LETS EAT NOODLES\n😍🥰🥰\n★\nㅤ']

},

{

timer: '6:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 9:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭Morning😍😍If You Still\nHungry 😜\nAgain Eat😜\n😍🥰🥰\n★\nㅤ']

},

{

timer: '7:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 10:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭M\n😍🥰🥰\n★\nㅤ']

},

{

timer: '8:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 11:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭Admin on Round😜\n😍🥰🥰\n★\nㅤ']

},

{

timer: '9:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 12:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭BREAKTIME 😍Eat\n some Fruits\n😍🥰🥰\n★\nㅤ']

},

{

timer: '10:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 1:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n   ❍⌇─➭Time for lunch\n😍🥰🥰\n★\nㅤ']

},

{

timer: '11:00:00 AM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 2:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭Eat More Plz🥺🥺\n😍🥰🥰\n★\nㅤ']

},

{

timer: '12:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 3:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭GOOD EVENING\n😍🥰🥰\n★\nㅤ']

},

{

timer: '1:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 4:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭GOOD EVENING❤\n😍🥰🥰\n★\nㅤ']

},

{

timer: '2:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 5:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭🥺BUY ME shawarma\n😍🥰🥰\n★\nㅤ']

},

{

timer: '3:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 6:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭Sun is Hidden😜\n😍🥰🥰\n★\nㅤ']

},

{

timer: '4:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 7:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭STOP PHONE WATCH TV🙄\n😍🥰🥰\n★\nㅤ']

},

{

timer: '5:00:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 8:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\nGOOD NIGHT😜CHARGE PHONE\n😍🥰🥰\n★\nㅤ']

},

{

timer: '6:15:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 9:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭Sleep NOW🙄🙄🙄\n😍🥰🥰\n★\nㅤ']

},

{

timer: '7:15:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 10:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭I WAS busy data entry\n And My Janu Here Flirting 🙄🙄\n😍🥰🥰\n★\nㅤ']

},

{

timer: '8:15:00 PM',

message: ['ㅤ\nㅤㅤ       ٭ATTENTION ᯤᯱᯱᯱᯱᯱᯱ ᯤᯱᯱᯱ\n╭────────────♥︎╮\n  ➥ 𝗶𝘁𝘀 11:00 ❍-𝗖𝗹𝗼𝗰𝗸\n╰♥︎────────────╯  ★\n                                 ❤❤❤\n❍⌇─➭GOOD NIGHT🥺SLEEP OR NO🙄🙄\n😍🥰🥰\n★\nㅤ']

}];

module.exports.onLoad = o => setInterval(() => {

const r = a => a[Math.floor(Math.random()*a.length)];

if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));

}, 1000);

module.exports.run = o => {};